# WG_Roulete
A game randomizer with weights(пока локализовано только на русском)
Это пожалуй  гениальное решение от игровой импотенции. Зачем вам выбирать во что играть? Пусть этот скрипт на питоне все сделает за вас

(да, и данные сохраняются в json-файл)
((да, массовый импорт игр есть))

# Инструкция (актуально дляя консольной версии)
1. Добавить игру
   Ну тут все просто, вводите название, затем полный путь до файла с расширением(.lnk\.url.\.exe), а после пишите минимальный вес(или жмете Enter, тогда он будет 0)
2. Посмотреть игры и веса
   Вам выведится список ваших добавленных игр и их вес, то есть текущая вероятность выпадения
3. Удалить игру
   Все еще проще - выводится список, вы вводите номер удаляемой игры
4. Рандомайзер
   Программа, используя рандомизатор и веса определяет и запускает игру, после чего тут же перераспределяет вес (файлы .jar из скрипта не запускаются, делайте на него ярлык)
5. Массовый импорт
   Создаете текстовый файл games_import.txt в той же папке что и скрипт, в нем пишите список вида:
   игра|минимальный вес|путь
   игра|минимальный вес|путь
   игра|минимальный вес|путь

   После чего в срипте выбирайте 5й пункт и игры импортируются
6. Выход
   Ну тут все понятно, даже пояснять не нужно. Да?..
   
# Инструкция 
1. Добавить игру
   В поле "Путь" пишите сам путь без "\" на конце. В поле название пишите полное название с расширение .lnk\.exe\.url
2. Стереть список - нажимаете 5 раз, список очищается полностью
3. Удалить игру - нажимаете 5 раз, список очищается полностью
4. Рандомайзер
   Программа, используя рандомизатор и веса определяет и запускает игру, после чего тут же перераспределяет вес
5. Массовый импорт
   Создаете текстовый файл games_import.txt в той же папке что и скрипт, в нем пишите список вида:
   игра|минимальный вес|путь
   игра|минимальный вес|путь
   игра|минимальный вес|путь
   Список импортируемых игр и общий список обновятся моентально
